350 Final.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>350 Final</title>
<!-- 2015-05-01 Fri 14:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Reed Rosenbluth" />
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />


</head>
<body>
<div id="content">
<h1 class="title">350 Final</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. CIS 350 Final</a></li>
<li><a href="#sec-2">2. First Half (25%)</a>
<ul>
<li><a href="#sec-2-1">2.1. <span class="todo TODO">TODO</span> software process models</a></li>
<li><a href="#sec-2-2">2.2. <span class="todo TODO">TODO</span> agile</a></li>
<li><a href="#sec-2-3">2.3. <span class="todo TODO">TODO</span> software configuration management</a></li>
<li><a href="#sec-2-4">2.4. <span class="todo TODO">TODO</span> requirements gathering and coumentation</a></li>
<li><a href="#sec-2-5">2.5. <span class="todo TODO">TODO</span> requirement analysis</a></li>
<li><a href="#sec-2-6">2.6. <span class="todo TODO">TODO</span> software architecture</a></li>
<li><a href="#sec-2-7">2.7. <span class="todo TODO">TODO</span> design concepts</a></li>
<li><a href="#sec-2-8">2.8. <span class="todo TODO">TODO</span> design patterns</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Second Half (75%)</a>
<ul>
<li><a href="#sec-3-1">3.1. <span class="done DONE">DONE</span> usability and UI</a></li>
<li><a href="#sec-3-2">3.2. <span class="done DONE">DONE</span> integration</a></li>
<li><a href="#sec-3-3">3.3. <span class="done DONE">DONE</span> test driven development and defensive programming</a></li>
<li><a href="#sec-3-4">3.4. <span class="done DONE">DONE</span> analyzability (readability, understandability)</a></li>
<li><a href="#sec-3-5">3.5. <span class="done DONE">DONE</span> concurrency &amp; synchronization</a></li>
<li><a href="#sec-3-6">3.6. <span class="todo TODO">TODO</span> efficiency and performance</a></li>
<li><a href="#sec-3-7">3.7. <span class="todo TODO">TODO</span> code smells and refactoring</a></li>
<li><a href="#sec-3-8">3.8. <span class="todo TODO">TODO</span> testing basics</a></li>
<li><a href="#sec-3-9">3.9. <span class="todo TODO">TODO</span> black-box testing</a></li>
<li><a href="#sec-3-10">3.10. <span class="todo TODO">TODO</span> white-box testing</a></li>
<li><a href="#sec-3-11">3.11. <span class="todo TODO">TODO</span> debugging</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Reading assignments from 2nd half</a>
<ul>
<li><a href="#sec-4-1">4.1. Boswell, The Art of Readable Code, ch. 2-3</a></li>
<li><a href="#sec-4-2">4.2. McConnell, Code Complete, ch. 8, 23, 25-26</a></li>
<li><a href="#sec-4-3">4.3. Hunt &amp; Thomas, Pragmatic Programmer, ch. 4</a></li>
<li><a href="#sec-4-4">4.4. Fowler, Refactoring, ch. 2-3</a></li>
<li><a href="#sec-4-5">4.5. Braude, Software Engineering, ch. 24 and 26</a></li>
<li><a href="#sec-4-6">4.6. Ammann &amp; Offutt, Software Testing, ch. 1</a></li>
<li><a href="#sec-4-7">4.7. Jorgensen, Software Testing, ch. 5-6</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CIS 350 Final</h2>
<div class="outline-text-2" id="text-1">
<p>
75 point exam. 120 minutes. Double sided study sheet
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> First Half (25%)</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> software process models</h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> agile</h3>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> software configuration management</h3>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> requirements gathering and coumentation</h3>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> requirement analysis</h3>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> <span class="todo TODO">TODO</span> software architecture</h3>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> <span class="todo TODO">TODO</span> design concepts</h3>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> <span class="todo TODO">TODO</span> design patterns</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Second Half (75%)</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> usability and UI</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Why is usability important?
<ul class="org-ul">
<li><b>Therac-25</b> case study
<ul class="org-ul">
<li>Radiation therapy machine involved in at least 6 accidents
between 1985-1987
</li>
<li>patients were give massive overdoses of radiation
</li>
<li>It moved some safety features from hardware to software
</li>
<li>Software from the older version (Therac-20) was reused and
was assumed to be workign correctly
</li>
<li><b>Hamilton, Ontario, July 1985</b>
<ul class="org-ul">
<li>During treatment, machine stopped and reported "no does"
</li>
<li>This was a common occurence, so the technician pressed "P"
to proceed and re-deliver the dose
</li>
<li>This happened four more times, after which the machine went
into suspend mode
</li>
<li>Patient received 5x dose and died four months later
</li>
</ul>
</li>
<li>In Tyler Texas (1986) a technician reported "Malfunction 54"
which did not exist in the user manuel
<ul class="org-ul">
<li>the operator had requested 202 units, but only 6 were
delivered and the patient died five months later
</li>
<li>the manufacturer could not reproduce this bug so the
machine was put back into service
</li>
<li>Malfunction 54 happened again five weeks later and another
patient died
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>Definition of usability: <b>Five E's</b>
<ul class="org-ul">
<li>Effective
</li>
<li>Efficient
</li>
<li>Engaging
</li>
<li>Error Tolerant
</li>
<li>Easy to learn
</li>
</ul>
</li>
<li>User-centered design
<ul class="org-ul">
<li>needs, wants, and limitations of end users are given extensive attention
</li>
</ul>
</li>
<li>Information visualization and metaphors
</li>
<li>Measuring usability: studies, heuristics, metrics
<ul class="org-ul">
<li><b>Heuristics</b>
<ul class="org-ul">
<li>general guidelines or widely accepted "best practices"
</li>
<li>Nielsen's usability heuristics
<ul class="org-ul">
<li>Match between system and real world (skeumorphism)
</li>
<li>Consistency and standards
</li>
<li>Help and documentation
</li>
<li>User control and freedom
</li>
<li>visibility of system status
</li>
<li>Flexibility and efficiency of use
</li>
<li>error prevention
</li>
<li>recognition rather than recall
</li>
<li>recognize/diagnose erros
</li>
<li>aesthetic and minimalist design
</li>
</ul>
</li>
</ul>
</li>
<li><b>Usability studies</b>
<ul class="org-ul">
<li>observe people using the system under normal circumstances
</li>
<li>methods
<ul class="org-ul">
<li>surveys
</li>
<li>focus groups
</li>
<li>ethnography (field observation)
</li>
<li>observation in controlled setting
</li>
</ul>
</li>
</ul>
</li>
<li><b>Metrics</b>
<ul class="org-ul">
<li>measure quantitative aspects such as time to complete a task, error rate, memorability, etc.
</li>
<li>Task analysis
<ul class="org-ul">
<li><b>Hierarchical Task Analysis (HTA)</b>
<ul class="org-ul">
<li>task is broken down into goals and subgoals
</li>
</ul>
</li>
<li><b>Cognitative Task Analysis (CTA)</b>
<ul class="org-ul">
<li>also includes cognitative study (time spent thinking about what to do)
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><b>Human Reliability Assessment</b>
<ul class="org-ul">
<li>error rate: how often does the user make a mistake
</li>
<li>cognitive load: how much can the user keep in his mind during a task?
</li>
<li>memorability: how much does the user remember?
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="done DONE">DONE</span> integration</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>individual software modules are combined and <b>tested as a
group</b>. occurs after unit testing
</li>
<li><b>Big-bang integration</b>
<ul class="org-ul">
<li>write everything and hope
</li>
<li>all components are integrated simultaneously, after which
everything is tested as a whole
</li>
</ul>
</li>
<li><b>Top-down integration</b>
<ul class="org-ul">
<li>testing conducted from main module to sub module. If the sub
module is not developed then it is replaced by a temporary
program called a stub
</li>
</ul>
</li>
<li><b>Bottom-up integration</b>
<ul class="org-ul">
<li>lowest level components are tested first.
</li>
<li>they are then used to facilitate the testing of higher level
components
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="done DONE">DONE</span> test driven development and defensive programming</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><b>Test Driven Development</b>
<ul class="org-ul">
<li>write test cases <b>first</b>
</li>
<li>then write minimum amount of code to pass the test
</li>
<li>finally refactor the code to acceptable standards
</li>
</ul>
</li>
<li><b>Defensive Programing</b>
<ul class="org-ul">
<li><i>McConnell, Code Complete, ch. 8</i>
<ul class="org-ul">
<li>the recognition that programs will have problems and
modifications, and that a smart programmer will develop code
accordingly.
</li>
<li>Protecting program from <b>invalid inputs</b>
</li>
<li><b>Error handling</b>
<ul class="org-ul">
<li>Do nothing: garbage in, garbage out
</li>
<li>Notify the caller: garbage in, error out
</li>
<li>Shut it down: garbage in, nothing out
</li>
</ul>
</li>
<li><b>Assertions</b>
<ul class="org-ul">
<li>code used during development that allows a program to check
itself as it runs
</li>
<li>use error-handling code for conditions you expect to occur,
use assertions for conditions that should never occur
</li>
</ul>
</li>
<li><b>Exceptions</b>
<ul class="org-ul">
<li>a specific means by which code can pass along errors or
exceptional events to teh cade that called it
</li>
<li>try/catch in java
</li>
</ul>
</li>
</ul>
</li>
<li><i>Hunt &amp; Thomas, Pragmatic Programmer, ch. 4</i>
<ul class="org-ul">
<li><b>Design by Contract</b>
<ul class="org-ul">
<li>documenting the rights and responsibilities of software
modules to ensure program correctness.
</li>
<li><b>Preconditions</b>: a routines requirements
</li>
<li><b>Postconditions</b>: what the routine is guaranteed to do; the
state of the world when the routine is done
</li>
<li><b>Class invariants</b>: A class ensures that this condition is
always true from teh perspective of the caller.
</li>
</ul>
</li>
<li>Implementing DBC
<ul class="org-ul">
<li>Can partially emulate contracts with <b>assertions</b>, but
assertions don't propogate down an inheritance hierarchy.
</li>
<li>Some languages have built in support for DBC (like Eiffel)
</li>
</ul>
</li>
<li>Use exceptions rarely, for unexpected events.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="done DONE">DONE</span> analyzability (readability, understandability)</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><b>Readability</b>: eas with which reader can identify and
differentiate tokens and their syntactic meaning
</li>
<li><b>Understandability</b>: ease with which reader can determine the
semantic meaning of a piece of code
</li>
<li><i>Boswell, The Art of Readable Code, ch. 2-3</i>
<ul class="org-ul">
<li><b>Packing Information into Names</b>
<ul class="org-ul">
<li><b>choose specific words</b>. <code>Size()</code> vs <code>Height()</code>,
<code>NumNodes()</code>, <code>MemoryBytes()</code>
</li>
<li><b>Avoid generic names</b> like <code>tmp</code> and =retval=* unless there
is a reason
</li>
<li><b>Prefer concrete names over abstract names</b> -
<code>ServerCanStart()</code> vs <code>CanListenOnPort()</code>
</li>
<li><b>Attaching extra information to a name</b>
<ul class="org-ul">
<li>Values with units: <code>delay</code> vs <code>delay_secs</code>
</li>
<li>other examples
<ul class="org-ul">
<li><code>password</code> vs <code>plaintext_password</code>
</li>
<li><code>html</code> vs <code>html_utf8</code>
</li>
</ul>
</li>
</ul>
</li>
<li><b>Use longer names for larger scopes</b>
</li>
<li><b>Use capitalization, underscores, etc. in a meaningful way</b>
</li>
</ul>
</li>
<li><b>The best names</b> are ones that can't be misconstrued 
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> <span class="done DONE">DONE</span> concurrency &amp; synchronization</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Early computers could only run one program at a time
</li>
<li><b>Multi-programming</b> operating systems (1970s) made it appear as
if multiple programs were running simultaneously
</li>
<li><b>Instruction-Level Parallelism</b>
<ul class="org-ul">
<li>rather than wait for an instruction to finish, start the next
one asap
</li>
<li><b>pipelining</b>: fetch/decode one instruction while executing another
</li>
</ul>
</li>
<li><b>Thread-Level Parallelism</b>
<ul class="org-ul">
<li>now we have threads, which allow programs to do more than one
thing at a time
</li>
<li><b>In Java</b>
<ul class="org-ul">
<li>each thread has it's own stack and program counter
</li>
<li>threads in the same process share a heap and static variables
</li>
<li>Defining and starting a Thread
<div class="org-src-container">

<pre class="src src-java">public class HelloRunnable implements Runnable {

    public void run() {
        System.out.println("Hello from a thread!");
    }

    public static void main(String args[]) {
        (new Thread(new HelloRunnable())).start();
    }
}
</pre>
</div>
</li>
<li>Threads can make code slower&#x2026; how?
</li>
<li>A <b>Race Condition</b> occurs when two or more threads can access
shared data and they try to change it at the same time.
</li>
</ul>
</li>
</ul>
</li>
<li><b>Synchronization</b>
<ul class="org-ul">
<li><b>synchronized methods</b>
<ul class="org-ul">
<li>in java use the <code>synchronized</code> keyword
</li>
<li>it is not possible for two invocations of synchronized methods
on the same object to interleave
</li>
<li>when a synchronized method exits, it establisheds a
happens-before relationship with any subsequent invocation of a
synchronized method for the same object. This guarantees that
the changes to the state of the object are visible to all
threads.
</li>
</ul>
</li>
<li><b>syncrhonized block</b>: you don't have to synchronize a whole method
<div class="org-src-container">

<pre class="src src-java">public void add(int value){

    synchronized(this){
        this.count += value;   
    }
}
</pre>
</div>
</li>
<li><b>Lock Objects</b> are a more sophisticated synchronization method
<div class="org-src-container">

<pre class="src src-java">public class Counter{

    private Lock lock = new Lock();
    private int count = 0;

    public int inc(){
        lock.lock();
        int newCount = ++count;
        lock.unlock();
        return newCount;
    }
}
</pre>
</div>
</li>
<li><b>Semaphores</b>
<ul class="org-ul">
<li>A semaphore maintains a set of <b>permits</b>.
</li>
<li>the <code>acquire()</code> method blocks until a permit is available and
then takes it.
</li>
<li>the <code>release()</code> method adds a permit, potentially releasing a
blocking acquirer
</li>
<li>semaphores are often used to <b>restrict</b> the number of threads
that can access some resource
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <span class="todo TODO">TODO</span> efficiency and performance</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>Tradeoffs of code optimization
<ul class="org-ul">
<li>an optimized program can rely on using more elaborate
algorithms, and may be more difficult to comprehend than an
unoptimized
</li>
</ul>
</li>
<li>Rules of thumb
<ul class="org-ul">
<li>use the right algorithm or data structure
</li>
<li>Measure, don't guess
</li>
<li>don't unnecessarily create objects
</li>
<li>don't do unnecessary work
</li>
</ul>
</li>
<li>Lazy evaluation and instantiation
</li>
<li>Making loops more efficient
</li>
<li>Memoization
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> <span class="todo TODO">TODO</span> code smells and refactoring</h3>
</div>
<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> <span class="todo TODO">TODO</span> testing basics</h3>
</div>
<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> <span class="todo TODO">TODO</span> black-box testing</h3>
</div>
<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> <span class="todo TODO">TODO</span> white-box testing</h3>
</div>
<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> <span class="todo TODO">TODO</span> debugging</h3>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Reading assignments from 2nd half</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Boswell, The Art of Readable Code, ch. 2-3</h3>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> McConnell, Code Complete, ch. 8, 23, 25-26</h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Hunt &amp; Thomas, Pragmatic Programmer, ch. 4</h3>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Fowler, Refactoring, ch. 2-3</h3>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Braude, Software Engineering, ch. 24 and 26</h3>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Ammann &amp; Offutt, Software Testing, ch. 1</h3>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Jorgensen, Software Testing, ch. 5-6</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Reed Rosenbluth</p>
<p class="date">Created: 2015-05-01 Fri 14:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
